Repository: mahirocoko/simple-personal-finance
Catalog: frontend/app/locales/*/messages.po
Languages: th

source: {0} transactions
th: {0} รายการ

source: + Add Goal
th: + เพิ่มเป้าหมาย

source: + Add Savings
th: + เพิ่มเงินออม

source: + Add Transaction
th: + เพิ่มรายการ

source: ✓ Completed!
th: ✓ สำเร็จแล้ว!

source: Add amount:
th: เพิ่มจำนวนเงิน:

source: Amount
th: จำนวนเงิน

source: Amount must be a number
th: จำนวนเงินต้องเป็นตัวเลข

source: Amount must be a valid number
th: จำนวนเงินต้องเป็นตัวเลขที่ถูกต้อง

source: Amount must be greater than 0
th: จำนวนเงินต้องมากกว่า 0

source: An error occurred while creating the goal. Please try again.
th: เกิดข้อผิดพลาดในการสร้างเป้าหมาย กรุณาลองอีกครั้ง

source: An error occurred while creating the transaction. Please try again.
th: เกิดข้อผิดพลาดในการสร้างรายการ กรุณาลองอีกครั้ง

source: Are you sure you want to delete this goal?
th: ต้องการลบเป้าหมายนี้?

source: Are you sure you want to delete this transaction?
th: ต้องการลบรายการนี้?

source: Balance
th: คงเหลือ

source: Cancel
th: ยกเลิก

source: Cannot be negative
th: ต้องไม่ติดลบ

source: Category
th: หมวดหมู่

source: Category must be a valid ID
th: หมวดหมู่ต้องถูกต้อง

source: Category must be selected
th: กรุณาเลือกหมวดหมู่

source: Create Goal
th: สร้างเป้าหมาย

source: Creating...
th: กำลังสร้าง...

source: Current amount cannot be negative
th: จำนวนเงินปัจจุบันต้องไม่ติดลบ

source: Current amount cannot exceed target amount
th: จำนวนเงินปัจจุบันต้องไม่เกินเป้าหมาย

source: Current amount must be a number
th: จำนวนเงินปัจจุบันต้องเป็นตัวเลข

source: Current amount must be a valid number
th: จำนวนเงินปัจจุบันต้องเป็นตัวเลขที่ถูกต้อง

source: Dashboard
th: แดชบอร์ด

source: Date
th: วันที่

source: Date is required
th: กรุณาระบุวันที่

source: Date must be in the future
th: วันที่ต้องเป็นอนาคต

source: Date must be in YYYY-MM-DD format
th: วันที่ต้องอยู่ในรูปแบบ ปปปป-ดด-วว

source: Deadline
th: ครบกำหนด

source: Deadline (Optional)
th: วันที่ครบกำหนด (ถ้ามี)

source: Deadline must be in the future
th: วันครบกำหนดต้องเป็นอนาคต

source: Deadline must be in YYYY-MM-DD format
th: วันครบกำหนดต้องอยู่ในรูปแบบ ปปปป-ดด-วว

source: Delete
th: ลบ

source: Description must be less than 200 characters
th: หมายเหตุต้องไม่เกิน 200 ตัวอักษร

source: e.g. Buy a new car
th: เช่น ซื้อรถใหม่

source: Error
th: ข้อผิดพลาด

source: Expense
th: รายจ่าย

source: Expense by Category
th: รายจ่ายแยกตามหมวดหมู่

source: Failed to create goal. Please try again.
th: สร้างเป้าหมายไม่สำเร็จ กรุณาลองอีกครั้ง

source: Failed to create transaction. Please try again.
th: สร้างรายการไม่สำเร็จ กรุณาลองอีกครั้ง

source: Goal Name
th: ชื่อเป้าหมาย

source: Goal name is required
th: กรุณาระบุชื่อเป้าหมาย

source: Goal name must be less than 100 characters
th: ชื่อเป้าหมายต้องไม่เกิน 100 ตัวอักษร

source: Income
th: รายรับ

source: Loading...
th: กำลังโหลด...

source: Must be a number
th: ต้องเป็นตัวเลข

source: Must be a valid number
th: ต้องเป็นตัวเลขที่ถูกต้อง

source: Must be a whole number
th: ต้องเป็นจำนวนเต็ม

source: Must be at least {min} characters
th: ต้องมีอย่างน้อย {min} ตัวอักษร

source: Must be greater than 0
th: ต้องมากกว่า 0

source: Must be less than {max} characters
th: ต้องไม่เกิน {max} ตัวอักษร

source: Must be one of: {options}
th: ต้องเป็นหนึ่งใน: {options}

source: No goals yet
th: ยังไม่มีเป้าหมาย

source: No transactions this month
th: ไม่มีรายการในเดือนนี้

source: Note
th: หมายเหตุ

source: Optional description
th: หมายเหตุเพิ่มเติม (ถ้ามี)

source: Personal Finance
th: การเงินส่วนบุคคล

source: Progress Preview
th: ตัวอย่างความคืบหน้า

source: Remaining
th: เหลือ

source: Save
th: บันทึก

source: Saved Amount (฿)
th: ออมไปแล้ว (฿)

source: Saving...
th: กำลังบันทึก...

source: Savings Goals
th: เป้าหมายการออม

source: Select Category
th: เลือกหมวดหมู่

source: Select language
th: เลือกภาษา

source: Select Month
th: เลือกเดือน

source: Target Amount (฿)
th: เป้าหมาย (฿)

source: Target amount must be a number
th: เป้าหมายต้องเป็นตัวเลข

source: Target amount must be a valid number
th: เป้าหมายต้องเป็นตัวเลขที่ถูกต้อง

source: Target amount must be greater than 0
th: เป้าหมายต้องมากกว่า 0

source: This field is required
th: กรุณากรอกข้อมูล

source: Transactions
th: รายรับ-รายจ่าย

source: Type
th: ประเภท

source: Type must be either income or expense
th: ประเภทต้องเป็นรายรับหรือรายจ่าย
